{
  "backend/main.mo": "Main Motoko actor implementing a mortgage tracker backend with user accounts, house management, payment tracking, dashboard summaries, and role-based access control using Internet Identity principals.",
  "feature_evidence.json": "Feature evidence report documenting deployment of Version 30 of the Mortgage Tracker application with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React components describing offline-first architecture, lazy loading, optimized queries, and UI features for the mortgage tracking application.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system variables for light and dark themes with purple-themed design and overflow prevention.",
  "frontend/index.html": "HTML entry point with Mortgage Tracker title, house icon favicon, and viewport meta preventing user zoom for consistent mobile experience.",
  "frontend/src/App.tsx": "Root application component with error boundary, offline-first shell rendering, lazy-loaded routes, Internet Identity authentication, profile setup modal, theme provider, and startup data bootstrapping with optimized React Query configuration.",
  "frontend/src/components/AddHouseDialog.tsx": "Dialog form for adding or editing houses with fields for name, total cost, interest rate, loan term, and down payment, featuring connection status indicators and intelligent retry logic during actor initialization.",
  "frontend/src/components/AddPaymentDialog.tsx": "Dialog form for recording new payments with amount input, payment method dropdown (Cash, Bank Transfer, Credit), date picker defaulting to today, and optional note field.",
  "frontend/src/components/ConnectionStatusIndicator.tsx": "Displays online/offline status with a popover showing pending sync count, last sync time, and a manual sync button. Uses connection status and background sync hooks to manage offline data synchronization.",
  "frontend/src/components/DashboardSummary.tsx": "Renders a dashboard with cards showing mortgage statistics (total houses, cost, paid, balance, interest, payments) and an overall payment progress bar with visual indicators.",
  "frontend/src/components/DeleteHouseDialog.tsx": "Alert dialog component for confirming house deletion with a warning that all associated payment records will be permanently removed. Handles the delete mutation and loading state.",
  "frontend/src/components/DeletePaymentDialog.tsx": "Alert dialog for confirming payment deletion, displaying payment details (amount, date, method, note) before allowing the user to permanently delete the payment record.",
  "frontend/src/components/EditPaymentDialog.tsx": "Dialog form for editing existing payment records with fields for amount, payment method, date (via calendar picker), and optional notes. Submits updates via the edit payment mutation.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright notice and attribution to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "Main navigation header with app logo, theme toggle, connection status indicator, user dropdown menu with logout, and navigation buttons for houses overview and app store listing pages.",
  "frontend/src/components/HouseSelector.tsx": "Dropdown select component for choosing a house from a list, displaying a home icon and triggering a callback when selection changes.",
  "frontend/src/components/LoadingAnimation.tsx": "A loading animation component that displays a rotating house icon with pulsing effects, progress bar, step indicator, and stalled warning. Accepts optional message, progress percentage, isStalled flag, and step text as props.",
  "frontend/src/components/PaymentHistory.tsx": "Displays a list of payments for a house with formatted currency and dates, showing empty state when no payments exist. Includes edit and delete functionality via dialog components and loading skeletons.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog for first-time user profile setup that prompts for a name and saves it using the useSaveCallerUserProfile hook. Cannot be dismissed and blocks interaction until completed.",
  "frontend/src/components/SetHouseCostDialog.tsx": "Empty file with no content.",
  "frontend/src/components/UpdateNotification.tsx": "A dialog component that notifies users when an app update is available, offering options to refresh immediately or dismiss. Displays an alert icon and explains that data and session will be preserved.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, using React Query to cache the actor based on identity. Initializes access control with admin token and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useActorWithRetry.ts": "Enhances useActor with intelligent retry logic using exponential backoff (up to 5 attempts), tracking connection state and elapsed time. Provides manual retry capability and comprehensive error handling to prevent unhandled promise rejections.",
  "frontend/src/hooks/useAppVersion.ts": "Manages app version checking with deferred initialization (3 seconds after load) to prioritize dashboard rendering. Compares frontend version (0.30.0) against backend, shows update notification when available, and handles refresh with cache clearing.",
  "frontend/src/hooks/useBackgroundSync.ts": "Processes offline sync queue when online and actor is ready, handling various operations (add/update/delete house, add/edit/delete payment) with retry logic (up to 3 attempts). Invalidates queries after successful sync and shows toast notifications for sync status.",
  "frontend/src/hooks/useBootstrapData.ts": "Fetches all initial app data in a single backend call and primes React Query caches with user profile, houses, and dashboard summary for instant navigation.",
  "frontend/src/hooks/useConcurrentDataLoader.ts": "Loads app data concurrently during initialization using the getBootstrapData backend method, tracking loading progress from 0-100% while priming React Query caches.",
  "frontend/src/hooks/useConnectionStatus.ts": "Monitors online/offline connection status using browser events and tracks whether the app was recently offline for user notifications.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality, identity management, and status tracking using DFINITY's AuthClient.",
  "frontend/src/hooks/usePerformanceMonitor.ts": "Monitors app loading performance by tracking active requests, simulating progress with loading steps, and detecting stalled requests after 10 seconds.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, houses, payments, and dashboard data with offline-first support, automatic sync queue management, and BigInt serialization.",
  "frontend/src/hooks/useReactQueryStartupDefaults.ts": "Configures React Query default options at runtime to reduce unnecessary refetches during startup by setting stale times, retry policies, and smart refetch conditions.",
  "frontend/src/hooks/useStartupPreload.ts": "Preloads critical assets and enables non-blocking data prefetching after the app shell is visible to improve perceived startup performance.",
  "frontend/src/hooks/useUsernamePasswordAuth.ts": "Empty file, likely a placeholder for username/password authentication functionality.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for light/dark theme colors, spacing, and chart colors using OKLCH color space.",
  "frontend/src/lib/assetCache.ts": "Browser CacheStorage manager that preloads and caches static assets (icons, themes) for instant reuse, with methods to initialize, retrieve, and clear cached assets.",
  "frontend/src/lib/bigIntUtils.ts": "Utility functions for converting BigInt values to serializable numbers and back, preventing React Query serialization errors for House, Payment, DashboardSummary, and AppVersion types.",
  "frontend/src/lib/offlineStorage.ts": "Offline storage manager using localStorage for persisting houses, payments, user profiles, and sync queue items with user-specific keys and CRUD operations.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient provider and InternetIdentity provider wrapping the main App component.",
  "frontend/src/pages/AppStoreListing.tsx": "Marketing page displaying app store listing materials including app description, feature highlights, screenshots, and SEO keywords for the Mortgage Tracker app.",
  "frontend/src/pages/Dashboard.tsx": "Individual house dashboard page showing house details, payment history, progress tracking, with navigation breadcrumbs and dialogs for adding payments, editing house, and deleting house.",
  "frontend/src/pages/HousesOverview.tsx": "Main dashboard page displaying all houses with progress tracking, filtering, sorting, and summary statistics; includes lazy-loaded components for performance and an empty state for new users.",
  "frontend/src/pages/LoginPage.tsx": "Landing page with Internet Identity authentication, featuring hero section, feature highlights (progress tracking, payment history, security), and a login card with biometric authentication UI.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining the design system with OKLCH color tokens, custom animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata file indicating this is a deployment task for Version 30 of the Mortgage Tracker application to production environment."
}